Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldFinishEnum Enumeration
 The weld finish.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldFinishEnum
Public Enumeration WeldFinishEnum
Members
Member name | Value | Description
WELD_FINISH_NONE | 0 |  No weld finish.
WELD_FINISH_GRIND | 1 |  The grind finish.
WELD_FINISH_MACHINE | 2 |  The machine finish.
WELD_FINISH_CHIP | 3 |  The chip finish.
WELD_FINISH_FINISHED_WELD | 4 |  The normally treated finish.
WELS_FINISH_SMOOTH_TRANSITION | 5 |  The smooth transition finish.
See Also
Reference
Tekla.Structures.Model Namespace